<<<<<<< HEAD
console.log('1. Слайдер изображений в секции destinations +50 \n - на десктоп варианте при клике на урезанную картинку слева или справа изображение меняется по принципу карусели (например если нажать правую картинку та что была в центре уезжает налево, а та что была видна наполовину оказывается справа). Слайдер может быть как конечным так и бесконечным - данный критерий не должен влиять на оценку + 20 \n - три точки внизу отображают "номер слайда", то есть каждому слайду соответствует свой кружочек, который становится активным при нахождении соответствующего ему слайда в центре. На мобильном варианте картинка одна, но поверх нее появляются стрелочки навигации (можно сделать как карусель или же затемнять кнопку если слайдер достиг края) +20 \n - анимации плавного перемещения для слайдера +10 \n');
console.log('2. Нажатие на кнопку Login (кнопка Account в мобильной версии) показывает сверстанный логин попап + 50 \n - логин попап соответствует верстке его закрытие происходит при клике вне попапа +25 \n - логин попап имеет 2 инпута (email и пароль) при нажатии на кнопку Sign In показывается браузерный алерт с введенными данными (для реализации можно использовать тег ) +25');
console.log('3. Нажатие на кнопку Register на Login попапе меняет разметку попапа на разметку Sign Up попапа согласно макету (То есть нажатие не закрывает модал а просто меняет его наполнение). +25');
=======
console.log('1.Вёрстка соответствует макету. Ширина экрана 390px + 48 \n - блок <header> + 6 \n - секция preview + 9 \n - секция steps + 9 \n - секция destinations + 9 \n - секция stories + 9 \n - блок <footer> + 6');
console.log('2. Ни на одном из разрешений до 320px включительно не появляется горизонтальная полоса прокрутки.Весь контент страницы при этом сохраняется: не обрезается и не удаляется + 15 \n - нет полосы прокрутки при ширине страницы от 1440рх до 390px + 7 \n - нет полосы прокрутки при ширине страницы от 390px до 320рх + 8');
console.log('3. На ширине экрана 390рх и меньше реализовано адаптивное меню + 22 \n - при ширине страницы 390рх панель навигации скрывается, появляется бургер - иконка + 2 \n - при нажатии на бургер - иконку плавно появляется адаптивное меню + 4 \n - адаптивное меню соответствует макету + 4 \n - при нажатии на крестик адаптивное меню плавно скрывается уезжая за экран + 4 \n - ссылки в адаптивном меню работают, обеспечивая плавную прокрутку по якорям + 4(все кроме Account, она пока что просто закрывает меню) \n - при клике по ссылке в адаптивном меню адаптивное меню плавно скрывается, также скрытие меню происходит если сделать клик вне данного окна + 4');
>>>>>>> parent of a5b4169 (Merge branch 'travel-part3' of https://github.com/perfilovv/travel into travel-part3)













